
Функция ПолучитьСкриптыБаш() Экспорт
	
	СписокМакетов = Новый СписокЗначений;
	
	ТипМакетаТекст = Метаданные.СвойстваОбъектов.ТипМакета.ТекстовыйДокумент;
	
	МакетыОбработки = Метаданные().Макеты;
	Для Каждого МетаданныеМакет Из МакетыОбработки Цикл
		
		Если МетаданныеМакет.ТипМакета <> ТипМакетаТекст
			Или Найти(ВРег(МетаданныеМакет.Имя), "BASH") <> 1 Тогда
			Продолжить;
		КонецЕсли;
		
		СписокМакетов.Добавить(МетаданныеМакет.Имя, МетаданныеМакет.Синоним);
		
	КонецЦикла;
	
	Возврат СписокМакетов;
	
КонецФункции

Функция ПолучитьНастройкиТЖ() Экспорт
	
	СписокНастроек = Новый СписокЗначений;
	
	ТипМакетаТекст = Метаданные.СвойстваОбъектов.ТипМакета.ТекстовыйДокумент;
	
	МакетыОбработки = Метаданные().Макеты;
	Для Каждого МетаданныеМакет Из МакетыОбработки Цикл
		
		Если МетаданныеМакет.ТипМакета <> ТипМакетаТекст
			Или Найти(ВРег(МетаданныеМакет.Имя), "LOGCFG") <> 1 Тогда
			Продолжить;
		КонецЕсли;
		
		СписокНастроек.Добавить(МетаданныеМакет.Имя, МетаданныеМакет.Синоним);
		
	КонецЦикла;
	
	Возврат СписокНастроек;

КонецФункции

Функция ПолучитьТекстМакета(ИмяМакета) Экспорт
	Возврат ПолучитьМакет(ИмяМакета).ПолучитьТекст();
КонецФункции
